jmeter.log
2021-10-20 11:12:42,286 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2021-10-20 11:12:42,298 INFO o.a.j.JMeter: Loading user properties from: D:\CeShiGongJu\apache-jmeter-5.4.1\bin\user.properties
2021-10-20 11:12:42,298 INFO o.a.j.JMeter: Loading system properties from: D:\CeShiGongJu\apache-jmeter-5.4.1\bin\system.properties
2021-10-20 11:12:42,305 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2021-10-20 11:12:42,305 INFO o.a.j.JMeter: Version 5.4.1
2021-10-20 11:12:42,305 INFO o.a.j.JMeter: java.version=1.8.0_102
2021-10-20 11:12:42,305 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2021-10-20 11:12:42,305 INFO o.a.j.JMeter: os.name=Windows 10
2021-10-20 11:12:42,305 INFO o.a.j.JMeter: os.arch=amd64
2021-10-20 11:12:42,306 INFO o.a.j.JMeter: os.version=10.0
2021-10-20 11:12:42,306 INFO o.a.j.JMeter: file.encoding=GBK
2021-10-20 11:12:42,306 INFO o.a.j.JMeter: java.awt.headless=true
2021-10-20 11:12:42,306 INFO o.a.j.JMeter: Max memory     =1073741824
2021-10-20 11:12:42,306 INFO o.a.j.JMeter: Available Processors =6
2021-10-20 11:12:42,309 INFO o.a.j.JMeter: Default Locale=English (EN)
2021-10-20 11:12:42,309 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2021-10-20 11:12:42,309 INFO o.a.j.JMeter: JMeterHome=D:\CeShiGongJu\apache-jmeter-5.4.1
2021-10-20 11:12:42,309 INFO o.a.j.JMeter: user.dir  =D:\Lianxi\jmeter_lianxi
2021-10-20 11:12:42,310 INFO o.a.j.JMeter: PWD       =D:\Lianxi\jmeter_lianxi
2021-10-20 11:12:42,310 INFO o.a.j.JMeter: IP: 192.168.5.20 Name: DESKTOP-S9DVI99 FullName: DESKTOP-S9DVI99
2021-10-20 11:12:42,312 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'D:\Lianxi\jmeter_lianxi\result.html'
2021-10-20 11:12:42,314 INFO o.a.j.s.FileServer: Default base='D:\Lianxi\jmeter_lianxi'
2021-10-20 11:12:42,315 INFO o.a.j.s.FileServer: Set new base='D:\Lianxi\jmeter_lianxi'
2021-10-20 11:12:42,568 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2021-10-20 11:12:42,577 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2021-10-20 11:12:42,581 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2021-10-20 11:12:42,585 INFO o.a.j.s.SaveService: Loading file: 中转仓库.jmx
2021-10-20 11:12:42,612 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2021-10-20 11:12:42,624 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-10-20 11:12:42,624 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-10-20 11:12:42,624 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-10-20 11:12:42,624 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-10-20 11:12:42,624 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2021-10-20 11:12:42,625 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2021-10-20 11:12:42,668 INFO o.a.j.JMeter: Creating summariser <summary>
2021-10-20 11:12:42,672 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2021-10-20 11:12:42,672 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: result.jtl
2021-10-20 11:12:42,672 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: D:\CeShiGongJu\apache-jmeter-5.4.1\bin\reportgenerator.properties
2021-10-20 11:12:42,673 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2021-10-20 11:12:42,679 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2021-10-20 11:12:42,681 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2021-10-20 11:12:42,682 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2021-10-20 11:12:42,687 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,687 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,687 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,689 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,689 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,690 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,690 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,690 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,690 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,690 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-10-20 11:12:42,691 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2021-10-20 11:12:42,691 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2021-10-20 11:12:42,691 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2021-10-20 11:12:42,691 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2021-10-20 11:12:42,691 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2021-10-20 11:12:42,691 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2021-10-20 11:12:42,696 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2021-10-20 11:12:42,697 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-10-20 11:12:42,697 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-10-20 11:12:42,700 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2021-10-20 11:12:42,700 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2021-10-20 11:12:42,946 INFO o.a.j.JMeter: 正在运行的测试 (1634699562946)
2021-10-20 11:12:42,978 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 线程组
2021-10-20 11:12:42,979 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 线程组.
2021-10-20 11:12:42,979 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2021-10-20 11:12:42,979 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2021-10-20 11:12:42,983 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2021-10-20 11:12:42,983 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2021-10-20 11:12:42,985 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-1
2021-10-20 11:12:43,002 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-S9DVI99
2021-10-20 11:12:43,005 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2021-10-20 11:12:43,006 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2021-10-20 11:12:43,007 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2021-10-20 11:12:43,007 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2021-10-20 11:12:43,007 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2021-10-20 11:12:43,551 INFO o.a.j.t.JMeterThread: Thread is done: 线程组 1-1
2021-10-20 11:12:43,551 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-1
2021-10-20 11:12:43,554 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2021-10-20 11:12:43,558 INFO o.a.j.r.Summariser: summary =     11 in 00:00:01 =   18.1/s Avg:    45 Min:    17 Max:   166 Err:     0 (0.00%)
2021-10-20 11:12:43,563 INFO o.a.j.JMeter: Generating Dashboard
2021-10-20 11:12:43,563 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2021-10-20 11:12:43,585 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2021-10-20 11:12:43,956 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2021-10-20 11:12:43,956 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2021-10-20 11:12:43,958 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2021-10-20 11:12:43,958 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2021-10-20 11:12:43,965 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2021-10-20 11:12:43,976 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2021-10-20 11:12:43,976 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2021-10-20 11:12:43,976 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2021-10-20 11:12:43,984 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2021-10-20 11:12:43,984 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2021-10-20 11:12:43,985 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2021-10-20 11:12:43,985 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2021-10-20 11:12:43,987 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2021-10-20 11:12:43,987 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 77 samples
2021-10-20 11:12:43,987 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2021-10-20 11:12:43,987 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2021-10-20 11:12:43,987 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2021-10-20 11:12:43,988 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2021-10-20 11:12:43,988 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2021-10-20 11:12:43,988 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 165 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 33 samples
2021-10-20 11:12:43,990 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 11 samples
2021-10-20 11:12:43,991 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 11 samples produced in 386ms on channel 0
2021-10-20 11:12:43,991 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2021-10-20 11:12:44,092 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary?in context
2021-10-20 11:12:44,093 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2021-10-20 11:12:44,093 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2021-10-20 11:12:44,094 INFO o.a.j.r.d.JsonExporter: Checking output folder
2021-10-20 11:12:44,094 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to D:\Lianxi\jmeter_lianxi\result.html\statistics.json
2021-10-20 11:12:44,134 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2021-10-20 11:12:44,136 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: D:\Lianxi\jmeter_lianxi\result.html
2021-10-20 11:12:44,269 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: D:\Lianxi\jmeter_lianxi\result.html, creating folder structure
2021-10-20 11:12:44,273 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'D:\CeShiGongJu\apache-jmeter-5.4.1\bin\report-template' to 'D:\Lianxi\jmeter_lianxi\result.html', got message: D:\Lianxi\jmeter_lianxi\result.html, found non empty folder with following content [D:\Lianxi\jmeter_lianxi\result.html\statistics.json], will be ignored
2021-10-20 11:12:44,647 INFO o.a.j.JMeter: Dashboard generated